SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ДАТА FROM Н_ЛЮДИ 
    LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
    LEFT JOIN Н_СЕССИЯ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_СЕССИЯ.ЧЛВК_ИД
    WHERE Н_ЛЮДИ.ИД = 142095 AND Н_ВЕДОМОСТИ.ЧЛВК_ИД < 153285 AND Н_СЕССИЯ.ЧЛВК_ИД < 100622;

SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ДАТА FROM Н_ЛЮДИ 
    LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
    LEFT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
    WHERE Н_ЛЮДИ.ИД = 142095 AND Н_ВЕДОМОСТИ.ЧЛВК_ИД < 153285 AND Н_СЕССИЯ.ЧЛВК_ИД < 100622;

SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ДАТА FROM Н_ЛЮДИ 
    LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
    LEFT JOIN Н_СЕССИЯ ON Н_ВЕДОМОСТИ.СЭС_ИД = Н_СЕССИЯ.СЭС_ИД
    WHERE Н_ЛЮДИ.ИД = 142095 AND Н_ВЕДОМОСТИ.ЧЛВК_ИД < 153285 AND Н_СЕССИЯ.ЧЛВК_ИД < 100622;